RT-Thread/rt-thread/bsp/imxrt/product/board/MCUX_Config/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMXRT1171xxxxx
package_id: MIMXRT1171CVM8A
mcu_data: ksdk2_0
processor_version: 25.03.10
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"
#include "rtconfig.h"
#include "rthw.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: F15, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA0, pin_signal: GPIO_SD_B2_08}
  - {pin_num: H15, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA1, pin_signal: GPIO_SD_B2_09}
  - {pin_num: H14, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA2, pin_signal: GPIO_SD_B2_10}
  - {pin_num: F16, peripheral: FLEXSPI1, signal: FLEXSPI_A_DATA3, pin_signal: GPIO_SD_B2_11}
  - {pin_num: F17, peripheral: FLEXSPI1, signal: FLEXSPI_A_SS0_B, pin_signal: GPIO_SD_B2_06}
  - {pin_num: G14, peripheral: FLEXSPI1, signal: FLEXSPI_A_SCLK, pin_signal: GPIO_SD_B2_07}
  - {pin_num: M17, peripheral: LPSPI1, signal: PCS0, pin_signal: GPIO_AD_29}
  - {pin_num: L17, peripheral: LPSPI1, signal: SCK, pin_signal: GPIO_AD_28}
  - {pin_num: J17, peripheral: LPSPI1, signal: SIN, pin_signal: GPIO_AD_31}
  - {pin_num: K17, peripheral: LPSPI1, signal: SOUT, pin_signal: GPIO_AD_30}
  - {pin_num: B16, peripheral: USDHC1, signal: usdhc_cmd, pin_signal: GPIO_SD_B1_00}
  - {pin_num: D15, peripheral: USDHC1, signal: usdhc_clk, pin_signal: GPIO_SD_B1_01}
  - {pin_num: C15, peripheral: USDHC1, signal: 'usdhc_data, 0', pin_signal: GPIO_SD_B1_02}
  - {pin_num: B17, peripheral: USDHC1, signal: 'usdhc_data, 1', pin_signal: GPIO_SD_B1_03}
  - {pin_num: B15, peripheral: USDHC1, signal: 'usdhc_data, 2', pin_signal: GPIO_SD_B1_04}
  - {pin_num: A16, peripheral: USDHC1, signal: 'usdhc_data, 3', pin_signal: GPIO_SD_B1_05}
  - {pin_num: K16, peripheral: ENET, signal: enet_mdc, pin_signal: GPIO_AD_32}
  - {pin_num: H17, peripheral: ENET, signal: enet_mdio, pin_signal: GPIO_AD_33}
  - {pin_num: E9, peripheral: ENET, signal: 'enet_tdata, 00', pin_signal: GPIO_DISP_B2_02}
  - {pin_num: D7, peripheral: ENET, signal: 'enet_tdata, 01', pin_signal: GPIO_DISP_B2_03}
  - {pin_num: C7, peripheral: ENET, signal: enet_tx_en, pin_signal: GPIO_DISP_B2_04}
  - {pin_num: C9, peripheral: ENET, signal: enet_ref_clk, pin_signal: GPIO_DISP_B2_05}
  - {pin_num: C6, peripheral: ENET, signal: 'enet_rdata, 00', pin_signal: GPIO_DISP_B2_06}
  - {pin_num: D6, peripheral: ENET, signal: 'enet_rdata, 01', pin_signal: GPIO_DISP_B2_07}
  - {pin_num: D8, peripheral: ENET, signal: enet_rx_er, pin_signal: GPIO_DISP_B2_09}
  - {pin_num: B5, peripheral: ENET, signal: enet_rx_en, pin_signal: GPIO_DISP_B2_08}
  - {pin_num: M15, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AD_25}
  - {pin_num: L13, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AD_24}
  - {pin_num: B6, peripheral: LPUART2, signal: CTS_B, pin_signal: GPIO_DISP_B2_12}
  - {pin_num: A5, peripheral: LPUART2, signal: RTS_B, pin_signal: GPIO_DISP_B2_13}
  - {pin_num: A6, peripheral: LPUART2, signal: RXD, pin_signal: GPIO_DISP_B2_11}
  - {pin_num: D9, peripheral: LPUART2, signal: TXD, pin_signal: GPIO_DISP_B2_10}
  - {pin_num: J15, peripheral: LPSPI4, signal: SCK, pin_signal: GPIO_SD_B2_00}
  - {pin_num: E15, peripheral: LPSPI4, signal: SIN, pin_signal: GPIO_SD_B2_03}
  - {pin_num: H13, peripheral: LPSPI4, signal: SOUT, pin_signal: GPIO_SD_B2_02}
  - {pin_num: J14, peripheral: LPSPI4, signal: PCS0, pin_signal: GPIO_SD_B2_01}
  - {pin_num: P13, peripheral: LPUART8, signal: RTS_B, pin_signal: GPIO_AD_05}
  - {pin_num: P15, peripheral: LPUART8, signal: RXD, pin_signal: GPIO_AD_03}
  - {pin_num: R13, peripheral: LPUART8, signal: TXD, pin_signal: GPIO_AD_02}
  - {pin_num: R14, peripheral: LPUART7, signal: RXD, pin_signal: GPIO_AD_01}
  - {pin_num: N12, peripheral: LPUART7, signal: TXD, pin_signal: GPIO_AD_00}
  - {pin_num: M14, peripheral: LPUART10, signal: TXD, pin_signal: GPIO_AD_15}
  - {pin_num: J16, peripheral: LPUART10, signal: CTS_B, pin_signal: GPIO_AD_34}
  - {pin_num: G17, peripheral: LPUART10, signal: RTS_B, pin_signal: GPIO_AD_35}
  - {pin_num: R6, peripheral: LPUART12, signal: RXD, pin_signal: GPIO_LPSR_01}/
  - {pin_num: N6, peripheral: LPUART12, signal: TXD, pin_signal: GPIO_LPSR_00}
  - {pin_num: N8, peripheral: LPI2C5, signal: SCL, pin_signal: GPIO_LPSR_05}
  - {pin_num: N7, peripheral: LPI2C5, signal: SDA, pin_signal: GPIO_LPSR_04}
  - {pin_num: M13, peripheral: WDOG1, signal: wdog_wdog_b, pin_signal: GPIO_AD_04}
  - {pin_num: N17, peripheral: LPUART10, signal: RXD, pin_signal: GPIO_AD_16}
  - {pin_num: U8, peripheral: GPIO6, signal: 'gpio_mux_io, 08', pin_signal: GPIO_LPSR_08}
  - {pin_num: P5, peripheral: GPIO6, signal: 'gpio_mux_io, 09', pin_signal: GPIO_LPSR_09}
  - {pin_num: P8, peripheral: GPIO6, signal: 'gpio_mux_io, 06', pin_signal: GPIO_LPSR_06}
  - {pin_num: N13, peripheral: GPIO3, signal: 'gpio_mux_io, 05', pin_signal: GPIO_AD_06}
  - {pin_num: T17, peripheral: GPIO3, signal: 'gpio_mux_io, 06', pin_signal: GPIO_AD_07}
  - {pin_num: R15, peripheral: GPIO3, signal: 'gpio_mux_io, 07', pin_signal: GPIO_AD_08}
  - {pin_num: R16, peripheral: GPIO3, signal: 'gpio_mux_io, 08', pin_signal: GPIO_AD_09}
  - {pin_num: R17, peripheral: GPIO3, signal: 'gpio_mux_io, 09', pin_signal: GPIO_AD_10}
  - {pin_num: P16, peripheral: GPIO3, signal: 'gpio_mux_io, 10', pin_signal: GPIO_AD_11}
  - {pin_num: P17, peripheral: GPIO3, signal: 'gpio_mux_io, 11', pin_signal: GPIO_AD_12}
  - {pin_num: L12, peripheral: GPIO3, signal: 'gpio_mux_io, 12', pin_signal: GPIO_AD_13}
  - {pin_num: N14, peripheral: GPIO3, signal: 'gpio_mux_io, 13', pin_signal: GPIO_AD_14}
  - {pin_num: N15, peripheral: GPIO3, signal: 'gpio_mux_io, 16', pin_signal: GPIO_AD_17}
  - {pin_num: M16, peripheral: GPIO3, signal: 'gpio_mux_io, 17', pin_signal: GPIO_AD_18}
  - {pin_num: L16, peripheral: GPIO3, signal: 'gpio_mux_io, 18', pin_signal: GPIO_AD_19}
  - {pin_num: K13, peripheral: GPIO3, signal: 'gpio_mux_io, 19', pin_signal: GPIO_AD_20}
  - {pin_num: K14, peripheral: GPIO3, signal: 'gpio_mux_io, 20', pin_signal: GPIO_AD_21}
  - {pin_num: K12, peripheral: GPIO3, signal: 'gpio_mux_io, 21', pin_signal: GPIO_AD_22}
  - {pin_num: J12, peripheral: GPIO3, signal: 'gpio_mux_io, 22', pin_signal: GPIO_AD_23}
  - {pin_num: L14, peripheral: GPIO3, signal: 'gpio_mux_io, 25', pin_signal: GPIO_AD_26}
  - {pin_num: N16, peripheral: GPIO3, signal: 'gpio_mux_io, 26', pin_signal: GPIO_AD_27}
  - {pin_num: A7, peripheral: GPIO11, signal: 'gpio_io, 15', pin_signal: GPIO_DISP_B2_14}
  - {pin_num: A4, peripheral: GPIO11, signal: 'gpio_io, 16', pin_signal: GPIO_DISP_B2_15}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#if defined(BSP_USING_LPUART)
/**
 * @brief LPUART pin init
 * @param none
 * @return none
*/
void board_lpuart_pin_init(void)
{
#if defined(BSP_USING_LPUART1)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 is configured as LPUART1_TXD */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 is configured as LPUART1_RXD */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_LPUART1 */
#if defined(BSP_USING_LPUART2)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_10_LPUART2_TXD,     /* GPIO_DISP_B2_10 is configured as LPUART2_TXD */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_11_LPUART2_RXD,     /* GPIO_DISP_B2_11 is configured as LPUART2_RXD */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_12_LPUART2_CTS_B,   /* GPIO_DISP_B2_12 is configured as LPUART2_CTS_B */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_13_LPUART2_RTS_B,   /* GPIO_DISP_B2_13 is configured as LPUART2_RTS_B */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_LPUART2 */
#if defined(BSP_USING_LPUART7)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_00_LPUART7_TXD,          /* GPIO_AD_00 is configured as LPUART7_TXD */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_01_LPUART7_RXD,          /* GPIO_AD_01 is configured as LPUART7_RXD */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_LPUART7 */
#if defined(BSP_USING_LPUART8)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_02_LPUART8_TXD,          /* GPIO_AD_02 is configured as LPUART8_TXD */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_03_LPUART8_RXD,          /* GPIO_AD_03 is configured as LPUART8_RXD */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_05_GPIO_MUX3_IO04,       /* GPIO_AD_05 is configured as GPIO_MUX3_IO04 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_LPUART8 */
#if defined(BSP_USING_LPUART10)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_15_LPUART10_TXD,         /* GPIO_AD_15 is configured as LPUART10_TXD */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_16_LPUART10_RXD,         /* GPIO_AD_16 is configured as LPUART10_RXD */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_34_LPUART10_CTS_B,       /* GPIO_AD_34 is configured as LPUART10_CTS_B */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_35_LPUART10_RTS_B,       /* GPIO_AD_35 is configured as LPUART10_RTS_B */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_LPUART10 */
#if defined(BSP_USING_LPUART12)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_LPSR_00_LPUART12_TXD,       /* GPIO_LPSR_00 is configured as LPUART12_TXD */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_LPSR_01_LPUART12_RXD,       /* GPIO_LPSR_01 is configured as LPUART12_RXD */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_LPUART12 */
}
#endif /* BSP_USING_LPUART */

#if defined(BSP_USING_FLEXSPI)
/**
 * @brief FLEXSPI pin init
 * @param none
 * @return none
*/
void board_flexspi_pin_init(void)
{
#if defined(BSP_USING_FLEXSPI1)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_06_FLEXSPI1_A_SS0_B,  /* GPIO_SD_B2_06 is configured as FLEXSPI1_A_SS0_B */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_07_FLEXSPI1_A_SCLK,   /* GPIO_SD_B2_07 is configured as FLEXSPI1_A_SCLK */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_08_FLEXSPI1_A_DATA00, /* GPIO_SD_B2_08 is configured as FLEXSPI1_A_DATA00 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_09_FLEXSPI1_A_DATA01, /* GPIO_SD_B2_09 is configured as FLEXSPI1_A_DATA01 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_10_FLEXSPI1_A_DATA02, /* GPIO_SD_B2_10 is configured as FLEXSPI1_A_DATA02 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_11_FLEXSPI1_A_DATA03, /* GPIO_SD_B2_11 is configured as FLEXSPI1_A_DATA03 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_FLEXSPI1 */
}
#endif /* BSP_USING_FLEXSPI */

#if defined(BSP_USING_SPI)
/**
 * @brief SPI pin init
 * @param none
 * @return none
*/
void board_spi_pin_init(void)
{
#if defined(BSP_USING_SPI1)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_29_GPIO_MUX3_IO28,       /* GPIO_AD_29 is configured as GPIO_MUX3_IO28 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_28_LPSPI1_SCK,           /* GPIO_AD_28 is configured as LPSPI1_SCK */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_30_LPSPI1_SOUT,          /* GPIO_AD_30 is configured as LPSPI1_SOUT */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_31_LPSPI1_SIN,           /* GPIO_AD_31 is configured as LPSPI1_SIN */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_SPI1 */
#if defined(BSP_USING_SPI4)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_00_LPSPI4_SCK,        /* GPIO_SD_B2_00 is configured as LPSPI4_SCK */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_01_LPSPI4_PCS0,       /* GPIO_SD_B2_01 is configured as LPSPI4_PCS0 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_02_LPSPI4_SOUT,       /* GPIO_SD_B2_02 is configured as LPSPI4_SOUT */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_03_LPSPI4_SIN,        /* GPIO_SD_B2_03 is configured as LPSPI4_SIN */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_SPI4 */
}
#endif /* BSP_USING_SPI */

#if defined(BSP_USING_I2C)
/**
 * @brief I2C pin init
 * @param none
 * @return none
*/
void board_i2c_pin_init(void)
{
#if defined(BSP_USING_I2C5)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_LPSR_04_LPI2C5_SDA,         /* GPIO_LPSR_04 is configured as LPI2C5_SDA */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_LPSR_05_LPI2C5_SCL,         /* GPIO_LPSR_05 is configured as LPI2C5_SCL */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_I2C5 */
}
#endif /* BSP_USING_I2C */

