RT-Thread/rt-thread/bsp/imxrt/product/board/MCUX_Config/pin_mux.c
#if defined(BSP_USING_SDIO)
/**
 * @brief SDIO pin init
 * @param none
 * @return none
*/
void board_sdio_pin_init(void)
{
#if defined(BSP_USING_SDIO1)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_00_USDHC1_CMD,        /* GPIO_SD_B1_00 is configured as USDHC1_CMD */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_01_USDHC1_CLK,        /* GPIO_SD_B1_01 is configured as USDHC1_CLK */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_02_USDHC1_DATA0,      /* GPIO_SD_B1_02 is configured as USDHC1_DATA0 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_03_USDHC1_DATA1,      /* GPIO_SD_B1_03 is configured as USDHC1_DATA1 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_04_USDHC1_DATA2,      /* GPIO_SD_B1_04 is configured as USDHC1_DATA2 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_05_USDHC1_DATA3,      /* GPIO_SD_B1_05 is configured as USDHC1_DATA3 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_SDIO1 */
}
#endif /* BSP_USING_SDIO */

#if defined(BSP_USING_ETH)
/**
 * @brief ETH pin init
 * @param none
 * @return none
*/
void board_eth_pin_init(void)
{
#if defined(BSP_USING_ENET)
#if defined(BSP_USING_PHY)
#if defined(PHY_USING_RTL8304)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_32_GPIO_MUX3_IO31,       /* GPIO_AD_32 is configured as GPIO_MUX3_IO31 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_33_GPIO_MUX4_IO00,       /* GPIO_AD_33 is configured as GPIO_MUX4_IO00 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#elif defined(PHY_USING_RTL8201F)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_32_ENET_MDC,             /* GPIO_AD_32 is configured as ENET_MDC */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_33_ENET_MDIO,            /* GPIO_AD_33 is configured as ENET_MDIO */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* PHY_USING_RTL8304 */
#if defined(BSP_USING_PHY_LED)
#if defined(BSP_USING_PHY_LED_PORT1)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_LPSR_08_GPIO_MUX6_IO08,     /* GPIO_LPSR_08 is configured as GPIO_MUX6_IO08 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_PHY_LED_PORT1 */
#if defined(BSP_USING_PHY_LED_PORT2)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_LPSR_09_GPIO_MUX6_IO09,     /* GPIO_LPSR_09 is configured as GPIO_MUX6_IO09 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_PHY_LED_PORT2 */
#endif /* BSP_USING_PHY_LED */
#if defined(BSP_USING_PHY_RST)
#if defined(PHY_USING_RTL8304)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_13_GPIO_MUX3_IO12,       /* GPIO_AD_13 is configured as GPIO_MUX3_IO12 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_RTL8304 */
#if defined(PHY_USING_RTL8201F)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_LPSR_12_GPIO_MUX6_IO12,     /* GPIO_LPSR_12 is configured as GPIO_MUX6_IO12 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* PHY_USING_RTL8201F */
#endif /* BSP_USING_PHY_RST */
#endif /* BSP_USING_PHY */
#if defined(BSP_USING_ETH_INT)
    /* GPIO configuration of PHY_INTR on GPIO_AD_12 (pin P17) */
    gpio_pin_config_t PHY_INTR_config = {
        .direction = kGPIO_DigitalInput,
        .outputLogic = 0U,
        .interruptMode = kGPIO_NoIntmode
    };
    /* Initialize GPIO functionality on GPIO_AD_12 (pin P17) */
    GPIO_PinInit(GPIO3, 11U, &PHY_INTR_config);
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_12_GPIO_MUX3_IO11,       /* GPIO_AD_12 is configured as GPIO_MUX3_IO11 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_ETH_INT */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_02_ENET_TX_DATA00,  /* GPIO_DISP_B2_02 is configured as ENET_TX_DATA00 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_03_ENET_TX_DATA01,  /* GPIO_DISP_B2_03 is configured as ENET_TX_DATA01 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_04_ENET_TX_EN,      /* GPIO_DISP_B2_04 is configured as ENET_TX_EN */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_05_ENET_REF_CLK,    /* GPIO_DISP_B2_05 is configured as ENET_REF_CLK */
        1U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_06_ENET_RX_DATA00,  /* GPIO_DISP_B2_06 is configured as ENET_RX_DATA00 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_07_ENET_RX_DATA01,  /* GPIO_DISP_B2_07 is configured as ENET_RX_DATA01 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_08_ENET_RX_EN,      /* GPIO_DISP_B2_08 is configured as ENET_RX_EN */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_09_ENET_RX_ER,      /* GPIO_DISP_B2_09 is configured as ENET_RX_ER */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_DISP_B2_05_ENET_REF_CLK,    /* GPIO_DISP_B2_05 PAD functional properties : */
        0x03U);                                 /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: high drive strength
                                                    Pull / Keep Select Field: Pull Disable, Highz
                                                    Pull Up / Down Config. Field: Weak pull down
                                                    Open Drain Field: Disabled
                                                    Domain write protection: Both cores are allowed
                                                    Domain write protection lock: Neither of DWP bits is locked */
#endif /* BSP_USING_ENET */
}
#endif /* BSP_USING_ETH */

