RT-Thread/rt-thread/bsp/imxrt/product/board/MCUX_Config/pin_mux.c
#if defined(BSP_USING_ESP32)
/**
 * @brief ESP32 pin init
 * @param none
 * @return none
*/
void board_esp32_pin_init(void)
{
#if defined(BSP_USING_ESP32_EN)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_06_GPIO_MUX3_IO05,       /* GPIO_AD_06 is configured as GPIO_MUX3_IO05 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_ESP32_EN */
}
#endif /* BSP_USING_ESP32 */

#if defined(BSP_USING_EFR32)
/**
 * @brief EFR32 pin init
 * @param none
 * @return none
*/
void board_efr32_pin_init(void)
{
#if defined(BSP_USING_EFR32_RST)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_07_GPIO_MUX3_IO06,       /* GPIO_AD_07 is configured as GPIO_MUX3_IO06 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_EFR32_RST */
}
#endif /* BSP_USING_EFR32 */

#if defined(BSP_USING_BUTTON)
/**
 * @brief Button pin init
 * @param none
 * @return none
*/
void board_button_pin_init(void)
{
#if defined(BSP_USING_BUTTON_BLE)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_08_GPIO_MUX3_IO07,       /* GPIO_AD_08 is configured as GPIO_MUX3_IO07 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_BUTTON_BLE */
#if defined(BSP_USING_BUTTON_RST)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_09_GPIO_MUX3_IO08,       /* GPIO_AD_09 is configured as GPIO_MUX3_IO08 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_BUTTON_RST */
}
#endif /* BSP_USING_BUTTON */

#if defined(BSP_USING_ANTENNA_RF_SWITCH)
/**
 * @brief Antenna RF Switch pin init
 * @param none
 * @return none
*/
void board_antenna_rf_switch_pin_init(void)
{
#if defined(BSP_USING_ANTENNA_RF_SWITCH_ESP32)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_10_GPIO_MUX3_IO09,       /* GPIO_AD_10 is configured as GPIO_MUX3_IO09 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_ANTENNA_RF_SWITCH_ESP32 */
#if defined(BSP_USING_ANTENNA_RF_SWITCH_EFR32)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_11_GPIO_MUX3_IO10,       /* GPIO_AD_11 is configured as GPIO_MUX3_IO10 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_ANTENNA_RF_SWITCH_EFR32 */
}
#endif /* BSP_USING_ANTENNA_RF_SWITCH */

#if defined(BSP_USING_TPM)
/**
 * @brief TPM pin init
 * @param none
 * @return none
*/
void board_tpm_pin_init(void)
{
#if defined(BSP_USING_TPM_RST)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_14_GPIO11_IO15,     /* GPIO_DISP_B2_14 is configured as GPIO11_IO15 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_TPM_RST */
#if defined(BSP_USING_TPM_PWR)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_DISP_B2_15_GPIO11_IO16,     /* GPIO_DISP_B2_15 is configured as GPIO11_IO16 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_TPM_PWR */
}
#endif /* BSP_USING_TPM */

#if defined(BSP_USING_WDT)
/**
 * @brief WDT pin init
 * @param none
 * @return none
*/
void board_wdt_pin_init(void)
{
#if defined(BSP_USING_WDT1)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_04_WDOG1_B,              /* GPIO_AD_04 is configured as WDOG1_B */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    rt_uint32_t level = rt_hw_interrupt_disable();
    WDOG1->WCR &= ~(uint16_t)WDOG_WCR_WDE_MASK;
    rt_hw_interrupt_enable(level);
#endif /* BSP_USING_WDT1 */
#if defined(BSP_USING_WDT_HW)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_LPSR_06_GPIO_MUX6_IO06,     /* GPIO_LPSR_06 is configured as GPIO_MUX6_IO06 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_WDT_HW */
}
#endif /* BSP_USING_WDT */

#if defined(BSP_USING_LED)
/**
 * @brief LED pin init
 * @param none
 * @return none
*/
void board_led_pin_init(void)
{
#if defined(BSP_USING_LED_TOP)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_14_GPIO_MUX3_IO13,       /* GPIO_AD_14 is configured as GPIO_MUX3_IO13 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_17_GPIO_MUX3_IO16,       /* GPIO_AD_17 is configured as GPIO_MUX3_IO16 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_18_GPIO_MUX3_IO17,       /* GPIO_AD_18 is configured as GPIO_MUX3_IO17 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_LED_TOP */
#if defined(BSP_USING_LED_MIDDLE)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_19_GPIO_MUX3_IO18,       /* GPIO_AD_19 is configured as GPIO_MUX3_IO18 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_20_GPIO_MUX3_IO19,       /* GPIO_AD_20 is configured as GPIO_MUX3_IO19 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_21_GPIO_MUX3_IO20,       /* GPIO_AD_21 is configured as GPIO_MUX3_IO20 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_LED_MIDDLE */
#if defined(BSP_USING_LED_BOTTOM)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_22_GPIO_MUX3_IO21,       /* GPIO_AD_22 is configured as GPIO_MUX3_IO21 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_23_GPIO_MUX3_IO22,       /* GPIO_AD_23 is configured as GPIO_MUX3_IO22 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_26_GPIO_MUX3_IO25,       /* GPIO_AD_26 is configured as GPIO_MUX3_IO25 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_LED_BOTTOM */
#if defined(BSP_USING_LED_BLUE)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_27_GPIO_MUX3_IO26,       /* GPIO_AD_27 is configured as GPIO_MUX3_IO26 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#endif /* BSP_USING_LED_BLUE */
}
#endif /* BSP_USING_LED */

